*    http://icspy.readthedocs.io/en/v0.3/ 
  DEADLINE: <2016-12-30 Fri 13:00>
  :PROPERTIES:
  :CUSTOM_ID: r
  :END:




#+BEGIN_SRC python :results output org drawer
url = 'https://calendar.google.com/calendar/ical/johnrkitchin%40gmail.com/private-df9cf193158bf265b35e6bb36e114a8e/basic.ics'

from ics import Calendar
from urllib.request import urlopen 
#c = Calendar(urlopen(url).read().decode('iso-8859-1'))
c = Calendar(open('../../../Downloads/basic.ics').read())
for event in c.events[0:1]:
    print(event.begin.format('<YYYY-MM-DD  HH:mm>'))
    print(dir(event.begin))
    print('''* {e.name}
  DEADLINE: <{e.begin}>--<{e.end}>
  :PROPERTIES:
  :ID: {e.uid}

Description: {e.description}

Location: {e.location}

'''.format(e=event))

#+END_SRC

#+RESULTS:
:RESULTS:
:END:
